Revit 2026 API

# FilteredElementIterator Properties

---

The FilteredElementIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FilteredElementIterator Class

Autodesk.Revit.DB Namespace